[
    {
        "month": "4",
        "num": 571,
        "link": "",
        "year": "2009",
        "news": "",
        "safe_title": "Can't Sleep",
        "transcript": "[[Someone is in bed, presumably trying to sleep. The top of each panel is a thought bubble showing sheep leaping over a fence.]]\n1 ... 2 ...\n\u003c\u003cbaaa\u003e\u003e\n[[Two sheep are jumping from left to right.]]\n\n... 1,306 ... 1,307 ...\n\u003c\u003cbaaa\u003e\u003e\n[[Two sheep are jumping from left to right. The would-be sleeper is holding his pillow.]]\n\n... 32,767 ... -32,768 ...\n\u003c\u003cbaaa\u003e\u003e \u003c\u003cbaaa\u003e\u003e \u003c\u003cbaaa\u003e\u003e \u003c\u003cbaaa\u003e\u003e \u003c\u003cbaaa\u003e\u003e\n[[A whole flock of sheep is jumping over the fence from right to left. The would-be sleeper is sitting up.]]\nSleeper: ?\n\n... -32,767 ... -32,766 ...\n\u003c\u003cbaaa\u003e\u003e\n[[Two sheep are jumping from left to right. The would-be sleeper is holding his pillow over his head.]]\n\n{{Title text: If androids someday DO dream of electric sheep, don't forget to declare sheepCount as a long int.}}",
        "alt": "If androids someday DO dream of electric sheep, don't forget to declare sheepCount as a long int.",
        "img": "https://imgs.xkcd.com/comics/cant_sleep.png",
        "title": "Can't Sleep",
        "day": "20"
    },
    {
        "month": "4",
        "num": 572,
        "link": "",
        "year": "2009",
        "news": "",
        "safe_title": "Together",
        "transcript": "[[A male and female are running in a field, holding hands. Another male and female stand in the background, next to a table.]]\n[[The man and woman are in a boat on a lake, very romantic. The man is speaking to the woman, illustrated with a heart.]]\n[[The man and woman sit together on a bench on a beach, watching the sunset.]]\n[[The man and woman stand at an altar. They have married.]]\n[[The man and woman, having grown old together, sit together on their doorstep, holding hands.]]\n[[The man begins walking away with his cane.]]\nWoman: Dear? Where are you--Come back!\n[[The man approaches the other couple from the first panel, who are now just as old.]]\n[[The man picks up a piece of paper from the table in the first panel and begins to write.]]\nMan: Okay,\n[[The paper is shown: a scavenger hunt list. \"Happiness\" has just been checked off.]]\nMan: What's next?\n[[Full list:\nSCAVENGER HUNT:\n[X] Indian-head penny\n[X] Snake skin\n[X] Happiness\n[  ] Four-leaf clover\n[  ] Shark tooth\n[...]\n]]\n{{Alt text: This scavenger hunt is getting boring. Let's go work on the treehouse!}}",
        "alt": "This scavenger hunt is getting boring.  Let's go work on the treehouse!",
        "img": "https://imgs.xkcd.com/comics/together.png",
        "title": "Together",
        "day": "22"
    },
    {
        "month": "4",
        "num": 573,
        "link": "",
        "year": "2009",
        "news": "",
        "safe_title": "Parental Trolling",
        "transcript": "The Future\n[[Man is sitting at a futuristic desktop computer, and a girl is standing behind him with a portable ultra-thin screen]]\nGirl: Hey dad, look at this old music video.\nVideo: We're no strangers to love...\nDad: Wow, you got me.\nGirl: Did your generation really use this to troll people?  SO lame.  Your generation sucked at pranks.\nDad: Did we?  I once raised a kid with conditioning so her speech centers shut down when she was upset.\nGirl: What?  No, you couldn't have bleegle warble yargle arggh!\nDad: Teehee!\n{{title-text: They'll pick music and culture that they know annoys you.  Building in behavioral easter eggs is a fair retaliation!}}",
        "alt": "They'll pick music and culture that they know annoys you.  Building in behavioral easter eggs is a fair retaliation!",
        "img": "https://imgs.xkcd.com/comics/parental_trolling.png",
        "title": "Parental Trolling",
        "day": "24"
    },
    {
        "month": "4",
        "num": 574,
        "link": "",
        "year": "2009",
        "news": "",
        "safe_title": "Swine Flu",
        "transcript": "Twitter is great for watching uninformed panics unfold live.\n[[Twitter search results page with \"Swine flu\" in the search box]]\nRealtime results for Swine flu\n1,918 more results since you started searching.  Refresh to see.\n{{All tweets are \"Less than 10 seconds ago from web\"}}\nSKEEVE37: Oh God I ate pork yesterday before I knew about swine flu!\nHANNELOREEC: Without duct tape I can't seal the door to keep out swine flu but I can't get duct tape without going outside! Help!\nPAULYSHOREFAN: How long until the swine flu reaches me here in Madagascar?\nCRACKMONKEY74: Swine flu is God's punishment for the ACLU and lesbians and 9\n11 and nanobots!\nTWILIGHT7531: I fell down the stairs and there was a crack and a jagged white thing is sticking out of my arm guys is this swine flu?\nWIGU: @UNTOWARD: No, that sounds like syphilis, not swine flu. What did you say you did with a pig?\n2011SENIORSRULE: My Dad said flu vaccines are linked to autism, so to be safe from swine flu I'm trying to lick an autistic kid.\n{{title text: Bad flu epidemics can hit young adults hardest because they provoke their powerful immune systems into overreaction, so to stay healthy spend the next few weeks drunk and sleep-deprived to keep yours suppressed.}}",
        "alt": "Bad flu epidemics can hit young adults hardest because they provoke their powerful immune systems into overreaction, so to stay healthy spend the next few weeks drunk and sleep-deprived to keep yours suppressed.",
        "img": "https://imgs.xkcd.com/comics/swine_flu.png",
        "title": "Swine Flu",
        "day": "27"
    },
    {
        "month": "4",
        "num": 575,
        "link": "",
        "year": "2009",
        "news": "",
        "safe_title": "Tag Combination",
        "transcript": "Guy: So you can come up with a song title fitting any tag combination?\nGirl: Try me.\nGuy: Lesbian voyeurism one-hit wonder mash-up.\nGirl: \"I wish that Stacey's Mom had Jessie's Girl.\"\n\u003c\u003csilence\u003e\u003e\nGuy: Well, that was one, but-\nGirl: \"When you Come On Eileen I touch myself.\"\nGuy: Okay, wow.\n{{Title-text: I love Eileen \n and want you to love her \n When you're around \n I'm one floor above her \n If you could see \n just how much I adore her \n Oh, that pretty red dress \n I'd do anything for her \n  (Too ra loo ra too ra loo rye ayy)}}",
        "alt": "I love Eileen / and want you to love her / When you're around / I'm one floor above her / If you could see / just how much I adore her / Oh, that pretty red dress / I'd do anything for her /  (Too ra loo ra too ra loo rye ayy)",
        "img": "https://imgs.xkcd.com/comics/tag_combination.png",
        "title": "Tag Combination",
        "day": "29"
    },
    {
        "month": "5",
        "num": 576,
        "link": "",
        "year": "2009",
        "news": "",
        "safe_title": "Packages",
        "transcript": "[[A dude is sitting at his computer.]]\nMan: I love getting pacakges.\n[[A woman enters.]]\nMan: I set up a script to search eBay et. al. (sic) for $1 items with free shipping.\n[[The man checks his doorstop; a package is waiting for him.]]\nMan: I gave it $365, so each day it can buy me something random.\nWoman: What if you just end up with lots of crap?\nMan: I'll give it away.  But I'm sure I'll end up with some interesting stuff.\n[[Day 1: Length of rubber hose]]\nMan: Could be handy around the house.\n[[Day 2: Ski mask]]\nMan: It's spring, but hey.\n[[Day 3: Bear trap]]\nMan: Huh.\n[[Day 4: Tourist map of the Pentagon]]\nWoman: Uh oh.\n[[Day 5: Lube]]\nMan: I'm stopping this before I end up on every F.B.I. watch list ever.\n{{alt-text: Day six: 'The hell? Who mails a bobcat?'}}",
        "alt": "Day six: 'The hell?  Who mails a bobcat?'",
        "img": "https://imgs.xkcd.com/comics/packages.png",
        "title": "Packages",
        "day": "1"
    },
    {
        "month": "5",
        "num": 577,
        "link": "",
        "year": "2009",
        "news": "For this week, xkcd will update once a day.",
        "safe_title": "The Race: Part 1",
        "transcript": "Huh, cool. Nathan Fillion (Mal from Firefly) has an electric skateboard. Just like you!\nDid you hear that? Nathan-\nI heard. Gimme the computer. I need to book a flight.\nTo be continued...",
        "alt": "Great, and you JUST finished paying off the settlement over the Wayne Coyne hamster ball incident.",
        "img": "https://imgs.xkcd.com/comics/the_race_part_1.png",
        "title": "The Race: Part 1",
        "day": "4"
    },
    {
        "month": "5",
        "num": 578,
        "link": "",
        "year": "2009",
        "news": "For this week, xkcd will update once a day (through Friday).",
        "safe_title": "The Race: Part 2",
        "transcript": "[[Man with skateboard and gear and woman are talking]]\nMan: \"Why race him?\" He's Captain Reynolds!\nWoman: Mr. Fillion is an actor. Firefly was years ago.\n[[They go over to a computer; the man is using a phone and presumably looking up a phone number]]\nWoman: He has his own life to live, and I'm sure the last thing he wants to do is indulge a fan by playing Mal for him.\n[[Nathan Fillion is standing in front of a mirror in a trenchcoat]]\nNathan: (into the mirror) Name's Captain Reynolds, ma'am. *ahem* Name's Captain Reynolds, ma'am.\nSomeone offpanel: Nathan? Telephone!\nNathan: That's Captain!\nSomeone offpanel: Fine, Captain Nathan.\nNathan: No, use my space name!\nSomeone offpanel: *sigh*\n[[Nathan and the skateboarder talk on the phone]]\nSkateboarder: So, how about we race for charities?\nNathan: Sure. Always did want a charity of my own.\nText between them: Come again?\nNathan: You know, boxes in supermarkets collecting food. 'Course, ought to tack up a list sayin' which wines I like best...\nSkateboarder: Uh, that's not quite...\nNathan: Listen, I'm the captain here.\nSkateboarder: ...I just got goosebumps when you said that.\nNathan: Yeah, happens to me too whenever I get captainy. I cut such a strapping figure. Buckle! Swash! All right, let's do this race.\n{{title text: The Hammer + Captain Tightpants == Captain Hammerpants?}}",
        "alt": "The Hammer + Captain Tightpants == Captain Hammerpants?",
        "img": "https://imgs.xkcd.com/comics/the_race_part_2.png",
        "title": "The Race: Part 2",
        "day": "5"
    },
    {
        "month": "5",
        "num": 579,
        "link": "",
        "year": "2009",
        "news": "For this week, xkcd will update once a day (through Friday).",
        "safe_title": "The Race: Part 3",
        "transcript": "[[Malcolm, Munrovian Male, and Summer Glau standing around with electric skateboards]]\nMalcolm Reynolds: meet a few of my friends. this is-\nMale: Summer Glau! you were the best part of Chronicles.\nSummer: I eat my bodyweight in food every 31 days. that's slightly faster than the human average.\n[[Summer stares off into space]]\nMalcom: yeah, there's a reason she only plays strange roles.\nMale: Ah.\nSummer (offscreen): I'm part of the floor now.\n[[They find Jewel Staite working on a skateboard's engine]]\nMalcolm: and this is Kaylee.\nJewel: my name is Jewel, Nathan.\nMalcolm: Kaylee-\nJewel: Jewel.\nMalcolm Jewel is fixin' up my new board.\nJewel:  almost done!\nMale: so wait. Summer's actually weird, Jewel's actually a mechanical whiz...\nMale: ...will Morena Baccarin be here? is she really a-\nMalcolm and Jewel: NO.\n[[Setting up for the race]]\nMalcolm: Kaylee, I've been gunnin' the radio hand throttle thingy for a while, but it ain't movin'\nJewel: oh, I must've set it to the wrong frequency!\nMale (riding around on haywire board): AAAAAAAA\n{{title text: No, the best things about The Sarah Connor Chronicles were: (1) watching Sarah and Cameron try to pass for normal, and (2) Cameron throwing people and things through walls.  Everything else was pretty secondary.}}",
        "alt": "No, the best things about The Sarah Connor Chronicles were: (1) watching Sarah and Cameron try to pass for normal, and (2) Cameron throwing people and things through walls.  Everything else was pretty secondary.",
        "img": "https://imgs.xkcd.com/comics/the_race_part_3.png",
        "title": "The Race: Part 3",
        "day": "6"
    },
    null
]